capillaryWave/128x128GA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32512;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightWall;
    }
    rightWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       32640;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftWall;
    }
    lowerWall
    {
        type            patch;
        nFaces          128;
        startFace       32768;
    }
    atmosphere
    {
        type            patch;
        nFaces          128;
        startFace       32896;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32768;
        startFace       33024;
    }
)

// ************************************************************************* //
